using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace gameproject
{
    internal class OutroAndDeath
    {
        public static void ShowWin()
        {
            Console.Clear();
            Console.ForegroundColor = ConsoleColor.Green;

            Console.WriteLine(@"                                                                                          
▄▄▄    ▄▄▄   ▄▄▄▄    ▄▄    ▄▄           ▄▄      ▄▄  ▄▄▄▄▄▄   ▄▄▄   ▄▄     ▄▄        ▄▄    
 ██▄  ▄██   ██▀▀██   ██    ██           ██      ██  ▀▀██▀▀   ███   ██     ██        ██    
  ██▄▄██   ██    ██  ██    ██           ▀█▄ ██ ▄█▀    ██     ██▀█  ██     ██        ██    
   ▀██▀    ██    ██  ██    ██            ██ ██ ██     ██     ██ ██ ██     ██        ██    
    ██     ██    ██  ██    ██            ███▀▀███     ██     ██  █▄██     ▀▀        ▀▀    
    ██      ██▄▄██   ▀██▄▄██▀            ███  ███   ▄▄██▄▄   ██   ███     ▄▄        ▄▄    
    ▀▀       ▀▀▀▀      ▀▀▀▀              ▀▀▀  ▀▀▀   ▀▀▀▀▀▀   ▀▀   ▀▀▀     ▀▀        ▀▀    
                                                                                          
                                                                                          
                                                                       ");

            Console.ResetColor();

            Console.WriteLine();
            Console.WriteLine("YOU WIN!");
            Console.WriteLine("Press any key to continue....");

            Console.ReadKey(true);
        }

        public static void ShowLose()
        {
            Console.Clear();
            Console.ForegroundColor = ConsoleColor.Green;

            Console.WriteLine(@"                                                                                                     
▄▄▄    ▄▄▄   ▄▄▄▄    ▄▄    ▄▄            ▄▄          ▄▄▄▄      ▄▄▄▄    ▄▄▄▄▄▄▄▄     ▄▄        ▄▄    
 ██▄  ▄██   ██▀▀██   ██    ██            ██         ██▀▀██   ▄█▀▀▀▀█   ██▀▀▀▀▀▀     ██        ██    
  ██▄▄██   ██    ██  ██    ██            ██        ██    ██  ██▄       ██           ██        ██    
   ▀██▀    ██    ██  ██    ██            ██        ██    ██   ▀████▄   ███████      ██        ██    
    ██     ██    ██  ██    ██            ██        ██    ██       ▀██  ██           ▀▀        ▀▀    
    ██      ██▄▄██   ▀██▄▄██▀            ██▄▄▄▄▄▄   ██▄▄██   █▄▄▄▄▄█▀  ██▄▄▄▄▄▄     ▄▄        ▄▄    
    ▀▀       ▀▀▀▀      ▀▀▀▀              ▀▀▀▀▀▀▀▀    ▀▀▀▀     ▀▀▀▀▀    ▀▀▀▀▀▀▀▀     ▀▀        ▀▀    
                                                                                                    
                                                                                                     ");

            Console.ResetColor();

            Console.WriteLine("YOU LOSE!");
            Console.WriteLine("Press any key to continue....");

            Console.ReadKey(true);
            //Console.ReadLine();//added so it doesnt close when you die
        }

    }
}
